# Development tools

brew "mise"
brew "direnv"

# Agents
brew "beads"
brew "claude-code"
brew "coderabbit"
brew "codex"
brew "gemini-cli"

# Containers
brew "docker"
brew "lazydocker"                  # Docker TUI
brew "docker-compose"
brew "k9s"

# Editors
brew "vim"
brew "neovim"

# Code quality
brew "shellcheck"                  # Shell script linter
brew "ctags"

# Infrastructure
brew "steampipe"

# Build tools
brew "cmake"
brew "make"
