tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "awscli"
brew "bash"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "docker"
brew "elixir"
brew "ffmpeg"
brew "getantibody/tap/antibody"
brew "git"
brew "go"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "postgresql"
brew "python"
brew "pyenv"
brew "ripgrep"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ruby"
brew "sed"
brew "shellcheck"
brew "terraform"
brew "terraform-docs"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "z"
brew "zsh"

cask "alfred"
cask "calibre"
cask "dropbox"
cask "evernote"
cask "flux"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "google-chrome"
cask "karabiner"
cask "postman"
cask "sequel-pro"
cask "skype"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "windscribe"
cask "zoomus"
